balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F5016.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="TMR4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="TMR4" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR4" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TMR4" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="TMR5HLD" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="TMR5HLD" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR5HLD" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TMR5HLD" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="TMR5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="TMR5" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR5" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TMR5" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PR4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111111111111111" edc:name="PR4" edc:nzwidth="0x10" edc:por="1111111111111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR4" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PR4" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PR5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111111111111111" edc:name="PR5" edc:nzwidth="0x10" edc:por="1111111111111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR5" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PR5" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-n------nnnn-n-" edc:cname="T4CON" edc:desc="" edc:impl="0xa07a" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000uuuuuuuu" edc:name="T4CON" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TCS" edc:desc="" edc:mask="0x1" edc:name="TCS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T32" edc:desc="" edc:mask="0x1" edc:name="T32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCKPS" edc:desc="" edc:mask="0x3" edc:name="TCKPS" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TGATE" edc:desc="" edc:mask="0x1" edc:name="TGATE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="TSIDL" edc:desc="" edc:mask="0x1" edc:name="TSIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TON" edc:desc="" edc:mask="0x1" edc:name="TON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="TCKPS0" edc:desc="" edc:mask="0x1" edc:name="TCKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TCKPS1" edc:desc="" edc:mask="0x1" edc:name="TCKPS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="TIMER4" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-n------nnn--n-" edc:cname="T5CON" edc:desc="" edc:impl="0xa072" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000uuuuuuuu" edc:name="T5CON" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TCS" edc:desc="" edc:mask="0x1" edc:name="TCS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TCKPS" edc:desc="" edc:mask="0x3" edc:name="TCKPS" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TGATE" edc:desc="" edc:mask="0x1" edc:name="TGATE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="TSIDL" edc:desc="" edc:mask="0x1" edc:name="TSIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TON" edc:desc="" edc:mask="0x1" edc:name="TON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="TCKPS0" edc:desc="" edc:mask="0x1" edc:name="TCKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TCKPS1" edc:desc="" edc:mask="0x1" edc:name="TCKPS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="TIMER5" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnrnnnnnnnnnnnn" edc:cname="QEICON" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="QEICON" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UPDN_SRC" edc:desc="" edc:mask="0x1" edc:name="UPDN_CNT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TQCS" edc:desc="" edc:mask="0x1" edc:name="TQCS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POSRES" edc:desc="" edc:mask="0x1" edc:name="POSRES" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TQCKPS0" edc:desc="" edc:mask="0x1" edc:name="TQCKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TQCKPS1" edc:desc="" edc:mask="0x1" edc:name="TQCKPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TQGATE" edc:desc="" edc:mask="0x1" edc:name="TQGATE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCDOUT" edc:desc="" edc:mask="0x1" edc:name="PCDOUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWPAB" edc:desc="" edc:mask="0x1" edc:name="SWPAB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QEIM0" edc:desc="" edc:mask="0x1" edc:name="QEIM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QEIM1" edc:desc="" edc:mask="0x1" edc:name="QEIM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QEIM2" edc:desc="" edc:mask="0x1" edc:name="QEIM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UPDN" edc:desc="" edc:mask="0x1" edc:name="UPDN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INDX" edc:desc="" edc:mask="0x1" edc:name="INDX" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QEISIDL" edc:desc="" edc:mask="0x1" edc:name="QEISIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CNTERR" edc:desc="" edc:mask="0x1" edc:name="CNTERR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="TQCKPS" edc:desc="" edc:mask="0x3" edc:name="TQCKPS" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="QEIM" edc:desc="" edc:mask="0x7" edc:name="QEIM" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="QEI" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnn----" edc:cname="DFLTCON" edc:desc="" edc:impl="0x7f0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----uuuuuuu----" edc:name="DFLTCON" edc:nzwidth="0x10" edc:por="-----0000000----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="QECK0" edc:desc="" edc:mask="0x1" edc:name="QECK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QECK1" edc:desc="" edc:mask="0x1" edc:name="QECK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QECK2" edc:desc="" edc:mask="0x1" edc:name="QECK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QEOUT" edc:desc="" edc:mask="0x1" edc:name="QEOUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CEID" edc:desc="" edc:mask="0x1" edc:name="CEID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IMV0" edc:desc="" edc:mask="0x1" edc:name="IMV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IMV1" edc:desc="" edc:mask="0x1" edc:name="IMV1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="QECK" edc:desc="" edc:mask="0x7" edc:name="QECK" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="IMV" edc:desc="" edc:mask="0x3" edc:name="IMV" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="POSCNT" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="POSCNT" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POSCNT" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="POSCNT" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="MAXCNT" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="MAXCNT" edc:nzwidth="0x10" edc:por="1111111111111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAXCNT" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="MAXCNT" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="22"/>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="IC1BUF" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="IC1BUF" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IC1BUF" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="IC1BUF" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
